#include <iostream>
#include <time.h>
using namespace std;
void game() {
    setlocale(LC_ALL, "Russian");
    int balance = 1000;
    int bid;
    cout << "Ваш баланс 1000\n";

    int chisla[3];  //Массив хранения выпадающих чисел.
    int continueGame;     //Переменная для хранения варианта продолжение игры либо выход.
    int start;     //Переменная для определения начала игры (дергание за ручку).
    do
    {
        for (int i = 0; i < 3; i++)
        {
            int a;
            a = rand() % 10;

            chisla[i] = a;
        }

        cout << "Введите вашу ставку: ";
        cin >> bid;
        balance -= bid;

        cout << "+---------------Выпало----------------+\n";
        cout << "\t\t|" << chisla[0] << "|" << chisla[1] << "|" << chisla[2] << "| \n";
        cout << "+---------------------------------------+\n";

        //проверка на 7 в цифре
        if (chisla[0] == 7 || chisla[1] == 7 || chisla[2] == 7)
        {
            cout << "+--------------Возврат ставки-------------------+\n";
            cout << "Поздравляю вам вернули вашу ставку\n";
            balance += bid;
            cout << "Ваш выиграш составил " << bid << " монет.\n";
            cout << "Ваш баланс: " << balance << "\n";
            cout << "+-----------------------------------------------+\n";
        }
        else  //проверка на джекпот
        {
            if (chisla[0] == chisla[1] && chisla[0] == chisla[2] && chisla[1] == chisla[2])
            {
                cout << "+--------------ДжекПот-------------------+\n";
                cout << "Поздравляю вы выиграли ДжекПот\n";
                bid *= 3;
                balance += bid;
                cout << "Ваш выиграш составил " << bid << " монет.\n";
                cout << "Ваш баланс: " << balance << "\n";
                cout << "+-----------------------------------------+\n";
            }
            else  //проверка на 2 цифры
            {
                if (chisla[0] == chisla[1] || chisla[0] == chisla[2] || chisla[1] == chisla[2])
                {
                    cout << "+--------------Выиграш-------------------+\n";
                    cout << "Поздравляю, совпало 2 цыфры!\n";
                    bid *= 2;
                    balance += bid;
                    cout << "Ваш выиграш составил " << bid << " монет.\n";
                    cout << "Ваш баланс: " << balance << "\n";
                    cout << "+----------------------------------------+\n";
                }
                else //проверка на все 777
                {
                    if (chisla[0] == 7 && chisla[1] == 7 && chisla[2] == 7)
                    {
                        cout << "+--------------СУПЕР ДЖЕКПОТ-------------------+\n";
                        cout << "Поздравляю вы выиграли СУПЕР ДЖЕКПОТ\n";
                        bid *= 5;
                        balance += bid;
                        cout << "Ваш выиграш составил " << bid << " монет.\n";
                        cout << "Ваш баланс: " << balance << "\n";
                        cout << "+----------------------------------------------+\n";
                    }
                    else
                    {
                        cout << "Вы ничего не выиграли.\n";
                        cout << "Ваш баланс " << balance << "\n";
                    }
                }
            }
        }
        //Запрос повторения игры или выход в меню.
        do
            {
            cout << "Повторить игру (Введите \"0\")\n";
            cout << "Выйти из игры (Введите \"1\")\n";
            cin >> continueGame;
            cout << "\n\n";
            if (continueGame < 0 || continueGame>1)
                {
                cout << "+--------------WARNING-------------------+\n";
                cout << "Вы ввели некоректные данные, повторите.\n";
                cout << "+-----------------------------------------+\n";
                }
            } while (continueGame < 0 || continueGame>1);
    }while (continueGame == 0 && balance > 0);
}